# 位运算符

# 按位与& (只有两个位都为1时，结果才为1)
'''
101
111
----
101
'''
print(5 & 3)  # 0101 & 0011 = 0001 = 1

# 按位或| (只要两个位有一个为1，结果就为1)
'''
101
111
----
111
'''
print(5 | 3)  # 0101 | 0011 = 0111 = 7

# 按位异或^ (两个位不同时，结果为1)
'''
101
111
----
010
'''
print(5 ^ 3)  # 0101 ^ 0011 = 0110 = 6

# 按位取反~ (将位上的0变为1，1变为0)
print(~5)  # 0101 -> 1010 -> -6
print(~-5)  # 1010 -> 0100 -> 4
print(~0)  # 0000 -> 1111 -> -1

# 左移<< (将二进制位向左移动指定的位数，右边空出来的位用0填充)
print(5 << 2)  # 0101 -> 10100 -> 20

# 右移>> (将二进制位向右移动指定的位数，左边空出来的位用0填充)
print(5 >> 2)  # 0101 -> 0001 -> 1