# 算数运算符
# | 运算符 | 描述     | 实例                                    |
# | ------ | ------ | ------------------------------------ |
# | `+`    | 加     | `10+20=30`                           |
# | `-`    | 减     | `10-20=-10`                          |
# | `*`    | 乘     | `10*20=200`                          |
# | `/`    | 除     | `10/20=0.5`                          |
# | `//`   | 取整除  | 返回除法的整数部分（商)`9∥2`输出结果`4`  |
# | `%`    | 取余数  | 返回除法的余数`9%2=1`                 |
# | `**`   | 幂     | 又称次方、乘方，`2*3=8`                |


print(4 + 1)
a = 10
b = 3
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a % b)   # 1  取余运算
print(a ** b)  # 1000  幂运算
print(a // b)  # 3  取整除 - 返回商的整数部分（向下取整）

print(3 + 2 * 4 ** 2)   # 先算指数运算，再算乘除运算，最后算加减运算
